Repository: mosabnaim/E-commerce-Logestechs
Catalog: languages/logestechs-*.po
Languages: ar

source: You do not have sufficient permissions to access this page.
ar: ليس لديك الصلاحيات الكافية للوصول إلى هذه الصفحة.

source: Transfer Order
ar: نقل الطلب

source: Request Pickup
ar: طلب إرجاع

source: company logo
ar: شعار الشركة

source: Oops...
ar: عفوًا...

source: Something went wrong.
ar: حدث خطأ ما.

source: Please fill out all fields.
ar: يرجى ملء جميع الحقول.

source: Company updated successfully!
ar: تم تحديث الشركة بنجاح!

source: Company added successfully!
ar: تمت إضافة الشركة بنجاح!

source: Are you sure?
ar: هل أنت متأكد؟

source: You are about to delete this company. This action cannot be undone.
ar: أنت على وشك حذف هذه الشركة. هذا الإجراء لا يمكن التراجع عنه.

source: Yes, delete it!
ar: نعم، احذفها!

source: No, keep it!
ar: لا، احتفظ بها!

source: Deleted!
ar: تم الحذف!

source: The company has been deleted.
ar: تم حذف الشركة.

source: Kept
ar: تم الاحتفاظ

source: The order has not been cancelled.
ar: لم يتم إلغاء الطلب.

source: You are about to cancel the order. This action cannot be undone.
ar: أنت على وشك إلغاء الطلب. هذا الإجراء لا يمكن التراجع عنه.

source: Yes, cancel it!
ar: نعم، ألغِ ذلك!

source: Cancelled!
ar: تم الإلغاء!

source: The order has been cancelled.
ar: تم إلغاء الطلب.

source: Failed to download the PDF.
ar: فشل تنزيل ملف PDF.

source: Please write at least 2 characters.
ar: يجب أن تكون كلمة المرور على الأقل حرفين.

source: loading...
ar: جار التحميل...

source: No matches found.
ar: لم يتم العثور على أي طلبات.

source: Print Invoice
ar: طباعة الفاتورة

source: All selected orders must belong to the same company to enable bulk printing.
ar: يجب أن تنتمي جميع الطلبات المحددة إلى نفس الشركة لتمكين الطباعة بالجملة.

source: All selected orders must be assignable to enable bulk transfer.
ar: يجب أن تكون جميع الطلبات المحددة قابلة للتخصيص لتمكين نقلها بالجملة.

source: All selected orders must not be assignable to enable bulk print.
ar: يجب أن لا تكون جميع الطلبات المحددة قابلة للتخصيص لتمكين الطباعة بالجملة.

source: Invalid sender phone number. It must start with a "+" followed by 9 to 14 digits.
ar: رقم الهاتف المرسل غير صالح. يجب أن يبدأ بعلامة '+' تتبعها من 9 إلى 14 رقمًا.

source: Order ID %s: Destination village has invalid value.
ar: معرف الطلب %s: قرية الوجهة لديها قيمة غير صالحة.

source: Store village has invalid value.
ar: قرية المتجر لديها قيمة غير صالحة.

source: You cannot select more than 20 posts at a time.
ar: لا يمكنك تحديد أكثر من 20 منشورًا في وقت واحد.

source: Failed.
ar: فشل.

source: Error while processing this action!
ar: حدث خطأ أثناء معالجة هذا الإجراء!

source: The Logestechs plugin requires WooCommerce to be active. Please activate WooCommerce for the Logestechs plugin to work properly.
ar: الإضافة الخاصة بـ Logestechs تتطلب تفعيل WooCommerce. يرجى تفعيل WooCommerce لضمان عمل إضافة Logestechs بشكل صحيح.

source: You do not have permission to perform this action.
ar: ليس لديك الصلاحيات الكافية للوصول إلى هذه الصفحة.

source: Draft
ar: مسودة

source: Pending
ar: قيد الانتظار

source: Being Processed
ar: تحت المعالجة

source: Cancelled
ar: تم الإلغاء

source: In Progress
ar: قيد التنفيذ

source: Delivered
ar: تم التوصيل

source: Returned
ar: مُرجع

source: Completed
ar: اكتمل

source: Failed
ar: فشل

source: Swapped
ar: تم الاستبدال

source: Brought
ar: تم إحضاره

source: The credentials you have provided are not correct.
ar: البيانات الاعتمادية التي قدمتها غير صحيحة.

source: Failed to initialize encryption.
ar: فشل في تهيئة التشفير.

source: This company already exists!
ar: هذه الشركة موجودة بالفعل!

source: There was an error saving the credentials to the database.
ar: حدث خطأ أثناء حفظ بيانات الاعتماد في قاعدة البيانات.

source: Bulk Transfer to %s
ar: نقل بالجملة إلى %s

source: Bulk Print from %s
ar: طباعة بالجملة من %s

source: Cancel Order on Logestechs
ar: إلغاء الطلب على Logestechs

source: Maximum orders allowed to transfer at once is 20
ar: الحد الأقصى لعدد الطلبات المسموح نقلها في وقت واحد هو 20

source: This order already transferred
ar: تم نقل هذا الطلب بالفعل

source: No company found to assign!
ar: لم يتم العثور على شركة للتعيين!

source: Unable to retrieve order details from Logestechs.
ar: غير قادر على استرداد تفاصيل الطلب من Logestechs.

source: No orders found.
ar: لم يتم العثور على أي طلبات.

source: Page %1$s of %2$s
ar: الصفحة %1$s من %2$s

source: There was an error fetching the villages. Please try again.
ar: حدث خطأ أثناء استرجاع القرى. يرجى المحاولة مرة أخرى.

source: Logestechs Actions
ar: إجراءات Logestechs

source: Error while deleting this item!
ar: حدث خطأ أثناء حذف هذا العنصر!

source: Cannot delete this company as it is associated with existing orders!
ar: لا يمكن حذف هذه الشركة لأنها مرتبطة بطلبات موجودة!

source: Domain is required.
ar: النطاق مطلوب.

source: Email is required.
ar: البريد الإلكتروني مطلوب.

source: Password is required.
ar: كلمة المرور مطلوبة.

source: Password should be at least 3 characters long.
ar: يجب أن تكون كلمة المرور على الأقل 3 أحرف.

source: Invalid company ID.
ar: معرف الشركة غير صالح.

source: Invalid COD value for the package.
ar: قيمة COD غير صالحة للحزمة.

source: Package items to deliver list is required.
ar: قائمة العناصر لتسليمها مطلوبة.

source: Invalid COD value for an item.
ar: قيمة COD غير صالحة للعنصر.

source: Either toCollectFromReceiver or toPayToReceiver is required for pickup.
ar: إما أن يكون toCollectFromReceiver أو toPayToReceiver مطلوبًا للتسليم.

source: All
ar: الكل

source: You are logged in using %s
ar: أنت مسجل الدخول باستخدام %s

source: Please add your account credentials
ar: الرجاء إضافة بيانات اعتماد حسابك

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Save Account
ar: حفظ الحساب

source: Close
ar: إغلاق

source: Manage Companies
ar: إدارة الشركات

source: Manage Shipments
ar: إدارة الشحنات

source: Sync Icon
ar: ايكون تزامن

source: Sync Status
ar: تحديث الحالة

source: Date
ar: التاريخ

source: Search Icon
ar: ايكون بحث

source: Search...
ar: البحث...

source: You have selected
ar: لقد قمت باختيار

source: Cancel
ar: إلغاء

source: Select All
ar: تحديد الكل

source: Order No.
ar: رقم الطلب

source: AWB No.
ar: رقم AWB

source: Shipping Company
ar: شركة الشحن

source: Status
ar: الحالة

source: Filter by status...
ar: تصفية حسب الحالة...

source: Notes
ar: ملاحظات

source: Action
ar: الإجراء

source: Order ID:
ar: رقم الطلب:

source: Destination village
ar: قرية الوجهة

source: Search for village...
ar: البحث عن قرية...

source: Do you want to use different store?
ar: هل ترغب في استخدام متجر مختلف؟

source: Business Name
ar: اسم العمل

source: Store Owner
ar: مالك المتجر

source: Store Phone Number
ar: رقم هاتف المتجر

source: Store village
ar: قرية المتجر

source: Store Address Line 1
ar: عنوان المتجر السطر 1

source: Store Address Line 2
ar: عنوان المتجر السطر 2

source: Domain
ar: النطاق

source: Add Company
ar: إضافة شركة

source: Update Company
ar: تحديث الشركة

source: Assign Company
ar: تعيين الشركة

source: Price
ar: السعر

source: Reservation Date
ar: تاريخ التسجيل

source: Shipment Type
ar: نوع الشحنة

source: Recipient
ar: تم إرجاعه من قبل المستلم

source: Expected Delivery Date
ar: تاريخ الإستلام

source: Phone Number
ar: رقم هاتف المتجر

source: Box Icon
ar: ايكون صندوق

source: Cancel Shipping
ar: إلغاء الشحنة
